In [1]:
import pandas as pd
import numpy as np

In [2]:
charterdf = pd.read_pickle('../../nowdata/charters_2015.pkl')

In [14]:
charterdf[['SCH_NAME','NCESSCH','YEAR_OPENED','TOTAL','ADDRESS16','WEBTEXT']].iloc[0:10]

,SCH_NAME,NCESSCH,YEAR_OPENED,TOTAL,ADDRESS16,WEBTEXT
0,NaN,1.001970e+10,2016.0,NaN,"3100 Cottage Hill Rd , Mobile AL 36606.0","[(http://www.maef.net/our-impact/, False, 1, M..."
1,NaN,2.000010e+10,1999.0,170.0,"1010 Fourth Avenue , Bethel AK 99559.0",[]
2,NaN,2.001500e+10,1998.0,190.0,"410 Schoenbar , Ketchikan AK 99901.0","[(https://www.kgbsd.org/ketchikancharter, Fals..."
3,NaN,2.001500e+10,2003.0,169.0,"410 Schoenbar Road , Ketchikan AK 99901.0","[(http://tongassschool.org/category/music/, Fa..."
4,NaN,2.001800e+10,1998.0,377.0,"1705 W 32nd Ave , Anchorage AK 99517.0","[(https://www.asdk12.org/aquarian, False, 0, S..."
5,NaN,2.001800e+10,1998.0,503.0,"401 E Fireweed Lane Suite 100 , Anchorage AK ...",[]
6,NaN,2.001800e+10,1998.0,NaN,NaN,[]
7,NaN,2.001800e+10,1998.0,NaN,NaN,[]
8,NaN,2.001800e+10,2005.0,273.0,"4802 Bryn MAWR Court , Anchorage AK 99508.0",[(http://winterberrycharterschool.com/parents/...
9,NaN,2.001800e+10,2005.0,176.0,"10901 Mausel St Suite 101 , Eagle River AK 99...",[(https://www.asdk12.org/aboutschools/eagleaca...

In [65]:
len(charterdf["NCESSCH"].head(500))-len(charterdf.head(500).drop_duplicates(subset="NCESSCH"))

18

In [7]:
def filter_duplicates(column):
	seen = []
	duplicate = []
	for i in np.arange(len(column)):
		if column[i] in seen: #check if value has been seen
			duplicate.append(column[i]) #if so, add to duplicates
		seen.append(column[i]) #store values that have already been seen
	return duplicate #return all duplicate values

In [11]:
len(list(charterdf))

680

In [63]:
len(filter_duplicates(list(charterdf.head(500)['NCESSCH']))) #function works

18

In [55]:
list(charterdf.head(500))[np.arange(len(charterdf.head(500).columns))[0]]

'NCESSCH'

In [8]:
def filter_duplicates_table(table,column_name):
    new_table = pd.DataFrame(columns = list(table)) #create an empty dataframe to store non-duplicate rows 
    for i in np.arange(table.shape[0]): #loop through all rows to find duplicates in each column 
        #column_name = list(table)[i]
        duplicates = filter_duplicates(table[column_name]) #use function to find duplicates in each column
        #duplicate_index = list()
        #for k in row_index: #loop through all values in the column 
        if table[column_name][i] in duplicates: #check if each column value is a duplicate value
            new_table = new_table.append(table.iloc[i]) #if so, add to new table 
                #duplicate_index = duplicate_index + [k]
        #row_index = duplicate_index
        #table = new_table
    return new_table

In [20]:
a = filter_duplicates_table(charterdf.head(500), 'NCESSCH')

In [ ]:
a.columns

In [9]:
def filter_exact_duplicates(table):
    #filtered = filter_duplicates_table(table, column_name).reset_index(drop=True)
    filtered= table.reset_index(drop=True)
    for i in np.arange(len(table.columns)): #loop through all columns except first to find duplicates in each column
        filtered = filter_duplicates_table(filtered, list(filtered)[i]).reset_index(drop=True)
    return filtered

In [7]:
def filter_exact_duplicates1(table, column_name):
    for i in np.arange()

SyntaxError: unexpected EOF while parsing (<ipython-input-7-56007ae05185>, line 1)

In [39]:
list(charterdf)[1]

'CMO_NAME'

In [10]:
filter_exact_duplicates(charterdf.head(500))

Empty DataFrame
Columns: [NCESSCH, CMO_NAME, CMO_MEMSUM, SCH_NAME, CMO_STATE, CMO_SCHNUM, CMO_URL, CMO_NUMSTATES, CMO_ALLSTATES, CMO_SECTOR, CMO_NUMSTUDENTS_CREDO17, CMO_TYPE, CMO_WEBTEXT, SURVYEAR, FIPST, STABR, SEANAME, LEAID, ST_LEAID, SCHID, ST_SCHID, MSTREET1, MSTREET2, MSTREET3, MCITY, MSTATE, MZIP, MZIP4, PHONE, LSTREET1, LSTREET2, LSTREET3, LCITY, LSTATE, LZIP, LZIP4, UNION, OUT_OF_STATE_FLAG, SCH_TYPE_TEXT, SCH_TYPE, RECON_STATUS, GSLO, GSHI, LEVEL, VIRTUAL, BIES, SY_STATUS_TEXT, SY_STATUS, UPDATED_STATUS_TEXT, UPDATED_STATUS, EFFECTIVE_DATE, CHARTER_TEXT, G13OFFERED, AEOFFERED, UGOFFERED, NOGRADES, CHARTAUTH1, CHARTAUTHN1, CHARTAUTH2, CHARTAUTHN2, IGOFFERED, WEBSITE, FRELCH, REDLCH, AE, TOTAL, AM, AMALM, AMALF, AS, ASALM, ASALF, HI, HIALM, HIALF, BL, BLALM, BLALF, WH, WHALM, WHALF, HP, HPALM, HPALF, TR, TRALM, TRALF, TITLEI_TEXT, TITLEI_STATUS, STITLEI, SHARED_TIME, MAGNET_TEXT, NSLPSTATUS_TEXT, NSLPSTATUS_CODE, NAME, OPSTFIPS, LSTREE, STFIP15, CNTY15, NMCNTY15, ...]
Index: []

[0 rows x 680 columns]